lgstoian/p4minishell/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.5 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PM_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# app_main builds the full LVGL UI (windows_init -> transcript/input/keyboard
# creation + transcript mirror printf) on the main task. The 3584-byte default
# overflows with a stack protection fault in vfprintf during shell_build_ui;
# 8192 matches the command worker task budget and gives the boot path headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Wi-Fi/IP event handlers call the shell transcript (vsnprintf formatting) and
# header notify hooks directly on the esp_event `sys_evt` task. The 2304-byte
# default overflows with a stack protection fault in the vfprintf machinery
# right after esp_wifi_start(); 8192 gives the handler path real headroom.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192


# ESP-Hosted on ESP32-P4 with ESP32-C6 co-processor over SDIO
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_SLOT=1
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=1
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=10000
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_HOST_RESTART_NO_COMMUNICATION_WITH_SLAVE=n
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=n
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_LABEL=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# USB host defaults required by the local usb component override.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
CONFIG_USB_HOST_RESET_HOLD_MS=30
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
CONFIG_USB_HOST_RESUME_HOLD_MS=30
CONFIG_USB_HOST_RESUME_RECOVERY_MS=20
CONFIG_USB_HOST_SUSPEND_ENTRY_MS=20
CONFIG_USB_OTG_SUPPORTED=y

# Station-only Wi-Fi profile. The networking module always calls
# esp_wifi_set_mode(WIFI_MODE_STA); disabling SoftAP support here makes the
# constraint structural rather than conventional, and reclaims the AP code
# path from the image.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# esp_wifi_remote mirrors the Wi-Fi Kconfig under its own WIFI_RMT_ prefix, and
# on the hosted path that mirror is the one that matters. Both must be set.
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=n

# Image-budget constraints. These were previously only in the generated
# sdkconfig, so regenerating it silently reverted them to the ESP-IDF defaults
# and grew the image. Pinning them here makes them durable.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# PSRAM XIP instruction/rodata mapping must stay disabled: enabling it
# overflows the flash/PSRAM budget at link time on this board.
CONFIG_SPIRAM_XIP_FROM_PSRAM=n
